import "./ui/Deploy.css";

export default function Deploy() {
    return <div>
        <h1>Публікація на Azure</h1>
        <h2>Передумови</h2>
        <p>
            При публікації статичних застосунків буде необхідно зазначити
            назву директорії, до якої переміщуються файли в результаті
            збірки (build). Для різних систем збирання це можуть бути 
            різні імена, наприклад, для класичного Реакту - це build, тоді
            як для Vite - це dist. Краще за все запустити процес збирання 
            та подивитись на результат (логи або структуру директорій)
            <br/>
            <code>npm run build</code>
        </p>
        <pre>
dist/index.html                   0.46 kB │ gzip:  0.30 kB{"\r\n"}
dist/assets/index-CYyoke_2.css    2.31 kB │ gzip:  0.85 kB{"\r\n"}
dist/assets/index-BCDLRcvm.js   233.66 kB │ gzip: 74.92 kB               
        </pre>
        <p>
            Також перед публікацією проєкт має бути розміщений на 
            репозитарії, Azure вільно працює з різними системами, 
            пропонуючи за замовчанням Github або DevOps
        </p>
        <h2>Створення ресурсу</h2>
        <img src="/img/res1.jpg" alt="res1" />
        <p>Ініціюємо створення нового ресурсу, задаємо пошук <i>Static Web app</i>
        </p><br/><br/>
        <img src="/img/res2.jpg" alt="res2" />
        <p>Орієнтуємось за назвою або за піктограмою (логотипом) сервісу, 
        переходимо до створення
        </p><br/><br/>
        <img src="/img/res3.jpg" alt="res3" />
        <p>Налаштовуємо ресурс: вибираємо ресурсну групу (не потрапило до рис.)
        Головне: обираємо бажаний план (Free), вводимо параметри 
        репозиторію (за необхідності авторизуємось), задаємо директорію
        підсумкового результату (збірки) - для системи Vite це dist.
        Натискаємо кнопку "Review + create", 
        </p><br/><br/>
        <img src="/img/res4.jpg" alt="res4" />
        <p>Коли з'явиться повідомлення 
        про готовність ресурсу перемикаємось на історію публікації 
        (Deployment history) та очікумо завершення збирання. Сторінку 
        потрібно періодично оновлювати або перемикатись на інші вкладки, 
        оскільки статус автоматично не оновлюється
        </p><br/><br/>
        <img src="/img/res5.jpg" alt="res5" />
        <p>Коли статус зміниться на "Success" натискаємо перехід до 
        сайту (з вкладки Get started або за URL у властивостях сервісу).
        Переконуємось у працездатності проєкту. 
        </p><br/><br/>

        <h2>Оновлення ресурсу</h2>
        <p>
            Вносимо зміни локально, перевіряємо усі тести. 
            Після випробувань усіх змін виконуємо оновлення 
            репозиторію (push). Це має запустити автоматичний 
            процес перезбирання проєкту на Azure. Контролюємо 
            його на вкладці Deployment history
        </p>
    </div>
};
/*
Д.З. Опублікувати фронтенд:
- створити проєкт (рекомендовано Реакт)
- опублікувати репозиторій
- створити сервіс статичних застосунків
- налаштувати його на роботу з репозиторієм проєкту
Як звіт прикласти посилання на сайт фронтенду
*/